Catalogs/Renault_внНастройкиПодписокНаСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_внНастройкиПодписокНаСобытия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МетаданныеОбъектаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_внТипТекстаПодписокНаСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МетаданныеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТЧ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_внНастройкиПодписокНаСобытия/Forms/ФормаВыбораМетаданныхУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Представление",	Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Имя",				Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ИмяТЧ",			Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ИндексКартинки",	Новый ОписаниеТипов("Число"));
	Дерево.Колонки.Добавить("Использование");	
	Дерево.Колонки.Добавить("ПолноеИмя");
	Дерево.Колонки.Добавить("СодержитЭлементы");
	Дерево.Колонки.Добавить("ЭтоОбъект");
	
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Константы, 					"Константы", 				"", 				2, Истина);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Справочники, 				"Справочники", 				"", 				3, Истина);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Документы, 					"Документы", 				"", 				4, Истина);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыВидовХарактеристик, 	"Планы видов характеристик","", 				5, Истина);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыСчетов, 				"Планы счетов", 			"", 				6, Истина);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыВидовРасчета, 			"Планы видов расчета", 		"", 				7, Истина);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.ПланыОбмена, 				"Планы обмена", 			"", 				8, Истина);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.РегистрыСведений, 			"Регистры-сведений", 		"", 				11, Истина);
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.БизнесПроцессы, 			"Бизнесс-процессы", 		"", 				10, Истина);	
	Renault_внОбщийМодуль.ДобавитьРегистрируемыеОбъекты(Дерево, Метаданные.Задачи, 					"Задачи", 					"", 				9, Истина);
	
	// Сначала установим все флаги рекурсивно
	СнятьВсеФлагиРегистрируемыхОбъектов(Дерево);
	
	ЗначениеВРеквизитФормы(Дерево, "Объекты");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии()
	
	НачальнаяПометкаКоллекцийНаСервере();
	
	ЗакрыватьПриВыборе = Истина;

КонецПроцедуры

&НаСервере
Процедура НачальнаяПометкаКоллекцийНаСервере()
	
	Дерево = РеквизитФормыВЗначение("Объекты", Тип("ДеревоЗначений"));
	ТЗ = ДанныеФормыВЗначение(ВыбранныеОбъекты, Тип("ТаблицаЗначений"));
	НачальнаяПометкаКоллекций(ТЗ, Дерево);
	ЗначениеВРеквизитФормы(Дерево, "Объекты");
	
КонецПроцедуры

&НаСервере
Процедура СнятьВсеФлагиРегистрируемыхОбъектов(СтрокиРегистрируемыеОбъекты)
	
	Для Каждого Стр Из СтрокиРегистрируемыеОбъекты.Строки Цикл
		Стр.Использование = Ложь;
		СнятьВсеФлагиРегистрируемыхОбъектов(Стр);
	КонецЦикла;
	
КонецПроцедуры

// Процедура НачальнаяПометкаКоллекций устанавливает пометку для коллекций
//
&НаСервере
Процедура НачальнаяПометкаКоллекций(ТЗНеРегистрируемые, ТекСтрока)

	ПараметрыОтбора = Новый Структура;
	
	Для каждого Строки Из ТекСтрока.Строки Цикл
				
		ПараметрыОтбора.Вставить("МетаданныеОбъекта", 	Строки.ПолноеИмя);
		ПараметрыОтбора.Вставить("ИмяТЧ", 				Строки.ИмяТЧ);
		ПараметрыОтбора.Вставить("ИмяРеквизита", 		Строки.Имя);
		НайденныеСтроки = ТЗНеРегистрируемые.НайтиСтроки(ПараметрыОтбора);				
		Если НайденныеСтроки.Количество() > 0 Тогда
			Строки.Использование = 1;
			ПометитьВложенныеЭлементыСервер(Строки);
			ПометитьЭлементыРодителейСервер(Строки.Родитель);				
		КонецЕсли;
		
		// Рекурсия
		Если Строки.Строки.Количество() > 0 Тогда
			НачальнаяПометкаКоллекций(ТЗНеРегистрируемые, Строки)
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // НачальнаяПометкаКоллекций

// Процедура рекурсивно устанавливает/снимает пометку для вложенных элементов начиная
// с передаваемого элемента.
//
// Параметры:
// Элемент      - ДанныеФормыКоллекцияЭлементовДерева 
//
&НаКлиенте
Процедура ПометитьВложенныеЭлементы(Элемент)

	ВложенныеЭлементы = Элемент.ПолучитьЭлементы();
	
	Если ВложенныеЭлементы.Количество() = 0 Тогда
		Если НЕ Элемент.ПолучитьРодителя() <> Неопределено Тогда
			Элемент.Использование = 0;
		КонецЕсли;		
	Иначе
		Для Каждого ВложенныйЭлемент ИЗ ВложенныеЭлементы Цикл
			ВложенныйЭлемент.Использование = Элемент.Использование;
			ПометитьВложенныеЭлементы(ВложенныйЭлемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьВложенныеЭлементыСервер(Элемент)

	ВложенныеЭлементы = Элемент.Строки;
	
	Если ВложенныеЭлементы.Количество() = 0 Тогда
		Если НЕ Элемент.Родитель <> Неопределено Тогда
			Элемент.Использование = 0;
		КонецЕсли;		
	Иначе
		Для Каждого ВложенныйЭлемент ИЗ ВложенныеЭлементы Цикл
			ВложенныйЭлемент.Использование = Элемент.Использование;
			ПометитьВложенныеЭлементыСервер(ВложенныйЭлемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура рекурсивно устанавливает/снимает пометку для родителей передаваемого элемента.
//
// Параметры:
// Элемент      - ДанныеФормыКоллекцияЭлементовДерева 
//
&НаКлиенте
Процедура ПометитьЭлементыРодителей(СтрокаРодитель)

	Если СтрокаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Использование = СтрокаРодитель.Использование;
	
	Если СтрокаРодитель.ПолучитьЭлементы().Количество() > 0 Тогда
		НайденыВключенные  = Ложь;
		НайденыВыключенные = Ложь;
		Для Каждого Строка Из СтрокаРодитель.ПолучитьЭлементы() Цикл
			Если Строка.Использование = 0 Тогда
				НайденыВыключенные = Истина;
			ИначеЕсли Строка.Использование = 1 Тогда
				НайденыВключенные  = Истина;
			ИначеЕсли Строка.Использование = 2 Тогда
				НайденыВыключенные = Истина;
				НайденыВключенные  = Истина;
			КонецЕсли;
			
			Если НайденыВключенные И НайденыВыключенные Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденыВключенные И НЕ НайденыВыключенные Тогда
			Использование = 1;
		ИначеЕсли НЕ НайденыВключенные И НайденыВыключенные Тогда
			Использование = 0;
		Иначе
			Использование = 2;
		КонецЕсли;
	КонецЕсли; 

	СтрокаРодитель.Использование = Использование;
	ПометитьЭлементыРодителей(СтрокаРодитель.ПолучитьРодителя());

КонецПроцедуры

&НаСервере
Процедура ПометитьЭлементыРодителейСервер(СтрокаРодитель)

	Если СтрокаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Использование = СтрокаРодитель.Использование;
	
	Если СтрокаРодитель.Строки.Количество() > 0 Тогда
		НайденыВключенные  = Ложь;
		НайденыВыключенные = Ложь;
		Для Каждого Строка Из СтрокаРодитель.Строки Цикл
			Если Строка.Использование = 0 Тогда
				НайденыВыключенные = Истина;
			ИначеЕсли Строка.Использование = 1 Тогда
				НайденыВключенные  = Истина;
			ИначеЕсли Строка.Использование = 2 Тогда
				НайденыВыключенные = Истина;
				НайденыВключенные  = Истина;
			КонецЕсли;
			
			Если НайденыВключенные И НайденыВыключенные Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденыВключенные И НЕ НайденыВыключенные Тогда
			Использование = 1;
		ИначеЕсли НЕ НайденыВключенные И НайденыВыключенные Тогда
			Использование = 0;
		Иначе
			Использование = 2;
		КонецЕсли;
	КонецЕсли; 

	СтрокаРодитель.Использование = Использование;
	ПометитьЭлементыРодителейСервер(СтрокаРодитель.Родитель);

КонецПроцедуры

&НаСервере
Процедура ПолучитьТЧНаСервере()
	
	ТЗ = ДанныеФормыВЗначение(ВыбранныеОбъекты, Тип("ТаблицаЗначений"));
	ТЗ.Очистить();
	
	Дерево = РеквизитФормыВЗначение("Объекты", Тип("ДеревоЗначений"));
	ЗаписатьРегистрируемыеОбъекты(ТЗ, Дерево);
	
	ЗначениеВРеквизитФормы(ТЗ, "ВыбранныеОбъекты");
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	
	ПолучитьТЧНаСервере();
	
	ОповеститьОВыборе(ВыбранныеОбъекты);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРегистрируемыеОбъекты(ТЧ, СтрокаОбъекта)
	
	// Запишем только регистрируемые объекты, все остальные удалим
	
	Для Каждого Стр Из СтрокаОбъекта.Строки Цикл
		
		Если НЕ ПустаяСтрока(Стр.ПолноеИмя) И Стр.Использование = 1 Тогда
			
			НоваяЗапись						= ТЧ.Добавить();
			НоваяЗапись.МетаданныеОбъекта	= Стр.ПолноеИмя;
			НоваяЗапись.ИмяТЧ				= Стр.ИмяТЧ;
			НоваяЗапись.ИмяРеквизита		= Стр.Имя;
			
		КонецЕсли;
		
		// Если есть флажок, дальше рекурсия
		Если Стр.СодержитЭлементы И Стр.Использование <> 0 И НЕ (Стр.ЭтоОбъект И Стр.Использование = 1) Тогда
			ЗаписатьРегистрируемыеОбъекты(ТЧ, Стр);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрируемыеОбъектыФормаИспользованиеПриИзменении(Элемент)
	
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	Если ТекущиеДанные.Использование = 2 Тогда
		ТекущиеДанные.Использование = 0;
	КонецЕсли;
	ПометитьВложенныеЭлементы(ТекущиеДанные);
	ПометитьЭлементыРодителей(ТекущиеДанные.ПолучитьРодителя());
	
КонецПроцедуры
